### Groupby, group rows together and aggregate

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company': ['GOOG','GOOG','AAPL','AAPL','GME','GME'],
       'Person': ['Billy','Sam','Mike','Ben','Charlie','Jack'],
       'Sales': [100,150,405,380,240,310]}

In [3]:
data

{'Company': ['GOOG', 'GOOG', 'AAPL', 'AAPL', 'GME', 'GME'],
 'Person': ['Billy', 'Sam', 'Mike', 'Ben', 'Charlie', 'Jack'],
 'Sales': [100, 150, 405, 380, 240, 310]}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

  Company   Person  Sales
0    GOOG    Billy    100
1    GOOG      Sam    150
2    AAPL     Mike    405
3    AAPL      Ben    380
4     GME  Charlie    240
5     GME     Jack    310

In [7]:
byCompany = df.groupby('Company')

In [8]:
byCompany.mean()

         Sales
Company
AAPL     392.5
GME      275.0
GOOG     125.0

In [11]:
byCompany.sum()

         Sales
Company
AAPL       785
GME        550
GOOG       250

In [13]:
byCompany.std()

             Sales
Company
AAPL     17.677670
GME      49.497475
GOOG     35.355339

In [15]:
byCompany.sum().loc['GME']

Sales    550
Name: GME, dtype: int64

In [16]:
df.groupby('Company').count()

         Person  Sales
Company
AAPL          2      2
GME           2      2
GOOG          2      2

In [17]:
df.groupby('Company').max()

        Person  Sales
Company
AAPL      Mike    405
GME       Jack    310
GOOG       Sam    150

In [18]:
df.groupby('Company').min()

          Person  Sales
Company
AAPL         Ben    380
GME      Charlie    240
GOOG       Billy    100